; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p5---int100n150-m25---int100c200---s44---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level4 level4)
(sum level0 level10 level10)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level3 level4)
(sum level1 level4 level5)
(sum level1 level10 level11)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level3 level5)
(sum level2 level4 level6)
(sum level2 level10 level12)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level3 level6)
(sum level3 level4 level7)
(sum level3 level10 level13)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level3 level7)
(sum level4 level4 level8)
(sum level4 level10 level14)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level3 level8)
(sum level5 level4 level9)
(sum level5 level10 level15)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level3 level9)
(sum level6 level4 level10)
(sum level6 level10 level16)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level3 level10)
(sum level7 level4 level11)
(sum level7 level10 level17)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level3 level11)
(sum level8 level4 level12)
(sum level8 level10 level18)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level3 level12)
(sum level9 level4 level13)
(sum level9 level10 level19)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level3 level13)
(sum level10 level4 level14)
(sum level10 level10 level20)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level3 level14)
(sum level11 level4 level15)
(sum level11 level10 level21)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level3 level15)
(sum level12 level4 level16)
(sum level12 level10 level22)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level3 level16)
(sum level13 level4 level17)
(sum level13 level10 level23)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level3 level17)
(sum level14 level4 level18)
(sum level14 level10 level24)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level3 level18)
(sum level15 level4 level19)
(sum level15 level10 level25)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level3 level19)
(sum level16 level4 level20)
(sum level16 level10 level26)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level3 level20)
(sum level17 level4 level21)
(sum level17 level10 level27)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level3 level21)
(sum level18 level4 level22)
(sum level18 level10 level28)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level3 level22)
(sum level19 level4 level23)
(sum level19 level10 level29)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level3 level23)
(sum level20 level4 level24)
(sum level20 level10 level30)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level3 level24)
(sum level21 level4 level25)
(sum level21 level10 level31)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level3 level25)
(sum level22 level4 level26)
(sum level22 level10 level32)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level3 level26)
(sum level23 level4 level27)
(sum level23 level10 level33)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level3 level27)
(sum level24 level4 level28)
(sum level24 level10 level34)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level3 level28)
(sum level25 level4 level29)
(sum level25 level10 level35)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level3 level29)
(sum level26 level4 level30)
(sum level26 level10 level36)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level3 level30)
(sum level27 level4 level31)
(sum level27 level10 level37)
(sum level27 level23 level50)
(sum level27 level25 level52)
(sum level28 level3 level31)
(sum level28 level4 level32)
(sum level28 level10 level38)
(sum level28 level23 level51)
(sum level28 level25 level53)
(sum level29 level3 level32)
(sum level29 level4 level33)
(sum level29 level10 level39)
(sum level29 level23 level52)
(sum level29 level25 level54)
(sum level30 level3 level33)
(sum level30 level4 level34)
(sum level30 level10 level40)
(sum level30 level23 level53)
(sum level31 level3 level34)
(sum level31 level4 level35)
(sum level31 level10 level41)
(sum level31 level23 level54)
(sum level32 level3 level35)
(sum level32 level4 level36)
(sum level32 level10 level42)
(sum level33 level3 level36)
(sum level33 level4 level37)
(sum level33 level10 level43)
(sum level34 level3 level37)
(sum level34 level4 level38)
(sum level34 level10 level44)
(sum level35 level3 level38)
(sum level35 level4 level39)
(sum level35 level10 level45)
(sum level36 level3 level39)
(sum level36 level4 level40)
(sum level36 level10 level46)
(sum level37 level3 level40)
(sum level37 level4 level41)
(sum level37 level10 level47)
(sum level38 level3 level41)
(sum level38 level4 level42)
(sum level38 level10 level48)
(sum level39 level3 level42)
(sum level39 level4 level43)
(sum level39 level10 level49)
(sum level40 level3 level43)
(sum level40 level4 level44)
(sum level40 level10 level50)
(sum level41 level3 level44)
(sum level41 level4 level45)
(sum level41 level10 level51)
(sum level42 level3 level45)
(sum level42 level4 level46)
(sum level42 level10 level52)
(sum level43 level3 level46)
(sum level43 level4 level47)
(sum level43 level10 level53)
(sum level44 level3 level47)
(sum level44 level4 level48)
(sum level44 level10 level54)
(sum level45 level3 level48)
(sum level45 level4 level49)
(sum level46 level3 level49)
(sum level46 level4 level50)
(sum level47 level3 level50)
(sum level47 level4 level51)
(sum level48 level3 level51)
(sum level48 level4 level52)
(sum level49 level3 level52)
(sum level49 level4 level53)
(sum level50 level3 level53)
(sum level50 level4 level54)
(sum level51 level3 level54)

(connected l0 l1)
(fuelcost level3 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l0 l3)
(fuelcost level10 l0 l3)
(connected l1 l0)
(fuelcost level3 l1 l0)
(connected l1 l2)
(fuelcost level4 l1 l2)
(connected l1 l3)
(fuelcost level23 l1 l3)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l1)
(fuelcost level4 l2 l1)
(connected l2 l3)
(fuelcost level10 l2 l3)
(connected l3 l0)
(fuelcost level10 l3 l0)
(connected l3 l1)
(fuelcost level23 l3 l1)
(connected l3 l2)
(fuelcost level10 l3 l2)

(at t0 l0)
(fuel t0 level54)
(= (total-cost) 0)

(at p0 l3)
(at p1 l0)
(at p2 l0)
(at p3 l3)
(at p4 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 5
2. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 0 of 5
3. (drive t0 l0 l3 level44 level10 level54)
   deleted: (at t0 l0) (fuel t0 level54)
   added: (at t0 l3) (fuel t0 level44)
   goals met: 0 of 5
4. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 5
5. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 5
6. (drive t0 l3 l2 level34 level10 level44)
   deleted: (at t0 l3) (fuel t0 level44)
   added: (at t0 l2) (fuel t0 level34)
   goals met: 0 of 5
7. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 5
8. (drive t0 l2 l0 level9 level25 level34)
   deleted: (at t0 l2) (fuel t0 level34)
   added: (at t0 l0) (fuel t0 level9)
   goals met: 0 of 5
9. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 1 of 5
10. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 2 of 5
11. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 3 of 5
12. (drive t0 l0 l1 level6 level3 level9)
   deleted: (at t0 l0) (fuel t0 level9)
   added: (at t0 l1) (fuel t0 level6)
   goals met: 3 of 5
13. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 4 of 5
14. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 5 of 5
